# Machine Learning Template Notebook
notebook template for ML project.
The purpose is to speed up the working flow with prepared cells.

In [3]:
# LIBRAIRIES
import numpy as np
import pandas as pd
from matplotlib import pyplot as plt
import seaborn as sns

In [4]:
# DATASET IMPORT
df = pd.read_csv('train.csv')

## 1. DATA ANALYSE
* check the size of the dataset (how many rows ? Columns ?), is it enough ? how many features ? ...
* check the data types of columns. Is there categorical values ? what are the columns names ? Are they relevant ? Waht is the label column name ?
* Show firsts and lasts rows. Do you understand all datas ? Is there empty cells ? Does it seems ok ?
* Show basics statistics. All columns have same numbers of data ? is there strange data ? (age min, max and mean...)

In [7]:
# Dataset dimensions
df.shape

(891, 12)

In [10]:
# Dataset types of data
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [16]:
# 5 first and last rows of the dataset
display(df.head())
display(df.tail())

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

_SibSp = frères / soeurs / époux.se onboard_

_Parch = parents / children onboard_

_Embarked = port of embarkment (Southampton, Queenstown, Cherbourg)_

In [20]:
# Some basic statistics
display(df.describe())
display(df.describe(include='object'))

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

                                     Name   Sex Ticket Cabin Embarked
count                                 891   891    891   204      889
unique                                891     2    681   147        3
top     Harper, Miss. Annie Jessie "Nina"  male   1601    G6        S
freq                                    1   577      7     4      644